<template>
  <div>
    <div class="header">
      <span class="search-header">搜索用户数</span>
      <svg
        t="1699408268889"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="1450"
        width="26"
        height="26"
      >
        <path
          d="M512 822c171.208 0 310-138.792 310-310s-138.792-310-310-310-310 138.792-310 310 138.792 310 310 310z m0 90c-220.914 0-400-179.086-400-400S291.086 112 512 112s400 179.086 400 400-179.086 400-400 400z"
          fill="#444444"
          p-id="1451"
        ></path>
        <path
          d="M468 505c0-24.852 20.148-45 45-45s45 20.148 45 45v150c0 24.852-20.148 45-45 45S468 679.852 468 655v-150zM468 373c0-24.852 20.148-45 45-45s45 20.148 45 45v1c0 24.852-20.148 45-45 45S468 398.852 468 374v-1z"
          fill="#444444"
          p-id="1452"
        ></path>
      </svg>
    </div>
    <div class="main">
      <span class="main-title">12321</span>
      <span class="main-content">17.1</span
      ><svg
        t="1699410351796"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="3217"
        width="16"
        height="16"
      >
        <path
          d="M917.333333 810.666667H128V192a21.333333 21.333333 0 0 0-42.666667 0v640a21.333333 21.333333 0 0 0 21.333334 21.333333h810.666666a21.333333 21.333333 0 0 0 0-42.666666z"
          p-id="3218"
          fill="#13b61e"
        ></path>
        <path
          d="M232.96 645.12a21.333333 21.333333 0 0 0 16.64-7.893333l158.933333-196.266667 151.68 160.213333a42.666667 42.666667 0 0 0 30.293334 13.44 42.666667 42.666667 0 0 0 30.72-12.373333l181.333333-180.053333a22.826667 22.826667 0 0 0 4.053333-5.973334v131.84a21.333333 21.333333 0 0 0 42.666667 0v-141.013333a64 64 0 0 0-64-64h-149.333333a21.333333 21.333333 0 0 0 0 42.666667h150.4a21.333333 21.333333 0 0 0-13.866667 5.973333l-181.333333 180.053333-151.68-160.213333a42.666667 42.666667 0 0 0-30.08-13.226667 39.893333 39.893333 0 0 0-30.72 11.946667l-162.346667 200.106667a21.333333 21.333333 0 0 0 3.2 29.653333 21.333333 21.333333 0 0 0 13.44 5.12z"
          p-id="3219"
          fill="#13b61e"
        ></path></svg
      >&nbsp;&nbsp;
      <svg
        t="1699410315596"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="14865"
        width="16"
        height="16"
      >
        <path
          d="M917.333333 810.666667H128V192a21.333333 21.333333 0 0 0-42.666667 0v640a21.333333 21.333333 0 0 0 21.333334 21.333333h810.666666a21.333333 21.333333 0 0 0 0-42.666666z"
          p-id="14866"
          fill="#d81e06"
        ></path>
        <path
          d="M376.96 576l1.706667 1.92a43.946667 43.946667 0 0 0 30.72 12.16A42.666667 42.666667 0 0 0 439.466667 576l151.68-160.426667 181.333333 181.76a21.333333 21.333333 0 0 0 13.866667 5.973334h-149.333334a21.333333 21.333333 0 0 0 0 42.666666h149.333334a64 64 0 0 0 64-64v-141.866666a21.333333 21.333333 0 1 0-42.666667 0v131.84a18.56 18.56 0 0 0-4.053333-5.973334l-181.333334-180.053333a44.8 44.8 0 0 0-30.72-12.373333 42.666667 42.666667 0 0 0-30.293333 13.44l-151.68 160.213333-159.146667-196.266667a21.333333 21.333333 0 0 0-29.866666-3.2 21.333333 21.333333 0 0 0-3.2 30.08z"
          p-id="14867"
          fill="#d81e06"
        ></path>
      </svg>
    </div>
    <div class="footer">
      <div class="charts" ref="charts"></div>
    </div>
  </div>
</template>

<script>
// 引入 echarts
import * as echarts from "echarts";

export default {
  name: "index",
  mounted() {
    // 初始化 echarts 实例
    let lineCharts = echarts.init(this.$refs.charts);
    // 配置数据
    lineCharts.setOption({
      xAxis: {
        // 隐藏 X 轴
        show: false,
        // 呈现出折线的效果
        type: "category",
      },
      yAxis: {
        // 隐藏 Y 轴
        show: false,
      },
      // 系列
      series: [
        {
          type: "line",
          data: [60, 30, 50, 20, 44, 40, 70, 48,],
          // 设置拐点样式  取消拐点显示
          itemStyle: {
            opacity: 0,
          },
          // 设置线条样式
          lineStyle: {
            color: "skyblue",
          },
          // 设置曲线平滑
          smooth: true,
          // 填充颜色的设置
          areaStyle: {
            color: {
              type: "linear",
              x: 0,
              y: 0,
              x2: 0,
              y2: 1,
              colorStops: [
                {
                  offset: 0,
                  color: "skyblue", // 0% 处的颜色
                },
                {
                  offset: 1,
                  color: "#fff", // 100% 处的颜色
                },
              ],
              global: false, // 缺省为 false
            },
          },
        },
      ],
      // 布局调试
      grid: {
        left: 0,
        top: 0,
        right: 0,
        bottom: 0,
      },
      // 鼠标放在点上的时候有提示信息
      tooltip: {},
    });
  },
};
</script>

<style scoped>
.header {
  display: flex;
  align-items: center;
}
.search-header {
  margin-right: 20px;
}
.main {
  margin: 10px 0;
}
.main-title {
  margin-right: 30px;
}
.main-content {
  margin-right: 10px;
}
.charts {
  width: 100%;
  height: 50px;
}
</style>
